In [1]:
!pip install pandas

Requirement already satisfied: pandas in /home/zarateadm/.local/lib/python3.8/site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.8/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: tzdata>=2022.1 in /home/zarateadm/.local/lib/python3.8/site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.20.3; python_version < "3.10" in /home/zarateadm/.local/lib/python3.8/site-packages (from pandas) (1.24.4)
Requirement already satisfied: pytz>=2020.1 in /home/zarateadm/.local/lib/python3.8/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: six>=1.5 in /home/zarateadm/.local/lib/python3.8/site-packages (from python-dateutil>=2.8.2->pandas) (1.15.0)

In [3]:
import pandas as pd
import numpy as np

### <font color=#003d5c> _Dataframes_ </font>
    
Un `DataFrame` es una estructura de datos que almacena datos de forma tabular, es decir, ordenada en filas y columnas etiquetadas. Cada fila (`row`) contiene una observación y cada columna (`column`) una variable. 
Un `DataFrame` acepta datos heterogéneos, o sea, las variables pueden ser de distintos tipos (numérico, string, boolean, etc.). 
Además de contener datos, un `DataFrame` contiene el nombre de las variables y sus tipos, y métodos que permiten acceder y modificar los datos.

```python
s = pd.DataFrame(data, ...)
```

La clase `pandas.DataFrame` permite crear dataframes a partir de datos que pueden corresponder a:

* Objetos de tipo dict.
* Series objetos tipo tuple.
* Objetos numpy.ndarray (arrays que contienen sólo números).
* Otros objetos instanciado de pandas.DataFrame.

Dichos datos pueden ser ingresados como argumentos del parámetro data al instanciarlos.

Los dataframes indexan por defecto las columnas y los encabezados con valores numéricos. Sin embargo, estos pueden ser modificados por el usuario.

In [30]:
pd.DataFrame(data=[(0, 1, 2), (1, 2, 3), (2, 3, 4), (3, 4, 5)])

   0  1  2
0  0  1  2
1  1  2  3
2  2  3  4
3  3  4  5

In [31]:
estudiantes = {'Nombre':["Hugo", "Paco", "Luis" ,"Pedro", "Juan", "Pablo"], 
                'Apellido':["López", "Silva", "Oca" , "Ramírez", "Gutiérrez", np.nan], 
                'Matrícula':["123455", "736923", "971298" ,"123098", "987656", "878652"], 
                'Edad':[20, 35, 30 ,25, np.nan, 23]}

In [32]:
pd.DataFrame(estudiantes)

  Nombre   Apellido Matrícula  Edad
0   Hugo      López    123455  20.0
1   Paco      Silva    736923  35.0
2   Luis        Oca    971298  30.0
3  Pedro    Ramírez    123098  25.0
4   Juan  Gutiérrez    987656   NaN
5  Pablo        NaN    878652  23.0

In [33]:
matriz = np.arange(9).reshape(3,3)
matriz

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [35]:
pd.DataFrame(matriz)

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

El parámetro index, permite incluir un índice a cada renglón.

In [37]:
registro = ("1a persona","2a persona","3a persona","4a persona","5a persona","6a persona")

In [38]:
pd.DataFrame(data = estudiantes, index = registro)

           Nombre   Apellido Matrícula  Edad
1a persona   Hugo      López    123455  20.0
2a persona   Paco      Silva    736923  35.0
3a persona   Luis        Oca    971298  30.0
4a persona  Pedro    Ramírez    123098  25.0
5a persona   Juan  Gutiérrez    987656   NaN
6a persona  Pablo        NaN    878652  23.0

El parámetro columns permite nombrar a las columnas.

In [39]:
matriz = np.arange(9).reshape((3,3))

In [40]:
pd.DataFrame(data = matriz, index=['uno','dos','tres'], columns=['a', 'b', 'c'])

      a  b  c
uno   0  1  2
dos   3  4  5
tres  6  7  8

In [41]:
pd.DataFrame(
[["Hugo","López",123455,20],
 ["Paco","Silva",736923,35],
 ["Luis","Oca",971298],
 ["Pedro","Ramírez",123098]    
], index = ["Registro 1","Registro 2","Registro 3","Registro 4"],
    columns = ["Nombre","Apellido","Matrícula","Edad"]
)

           Nombre Apellido  Matrícula  Edad
Registro 1   Hugo    López     123455  20.0
Registro 2   Paco    Silva     736923  35.0
Registro 3   Luis      Oca     971298   NaN
Registro 4  Pedro  Ramírez     123098   NaN

## Acceso a los elementos de un dataframe

Podemos acceder a los elementos de un dataframe mediante las siguientes maneras. Consideremos nuevamente el dataframe anterior:

In [42]:
estudiantes = pd.DataFrame(
[["Hugo","López","123455",20],
 ["Paco","Silva","736923",35],
 ["Luis","Oca","971298"],
 ["Pedro","Ramírez","123098"]    
], index = ["Registro 1","Registro 2","Registro 3","Registro 4"],
    columns = ["Nombre","Apellido","Matrícula","Edad"]
)

estudiantes

           Nombre Apellido Matrícula  Edad
Registro 1   Hugo    López    123455  20.0
Registro 2   Paco    Silva    736923  35.0
Registro 3   Luis      Oca    971298   NaN
Registro 4  Pedro  Ramírez    123098   NaN

In [44]:
# Acceso a una columna: usando el nombre de los campos
estudiantes["Nombre"]

Registro 1     Hugo
Registro 2     Paco
Registro 3     Luis
Registro 4    Pedro
Name: Nombre, dtype: object

In [45]:
# Acceso a varias columnas: usando el nombre de los campos
estudiantes[["Nombre","Edad"]]

           Nombre  Edad
Registro 1   Hugo  20.0
Registro 2   Paco  35.0
Registro 3   Luis   NaN
Registro 4  Pedro   NaN

In [46]:
# Acceso a una fila mediante el nombre del ínice del registro
estudiantes.loc[["Registro 2","Registro 4"]]

           Nombre Apellido Matrícula  Edad
Registro 2   Paco    Silva    736923  35.0
Registro 4  Pedro  Ramírez    123098   NaN

In [47]:
# Acceso a una fila mediante el número del índice del registro
estudiantes.iloc[1]

Nombre         Paco
Apellido      Silva
Matrícula    736923
Edad           35.0
Name: Registro 2, dtype: object

In [92]:
# Acceso a ciertas columnas y ciertas filas.
estudiantes.loc[["Registro 1","Registro 4"]][["Matrícula","Edad"]]

KeyError: "None of [Index(['Registro 1', 'Registro 4'], dtype='object', name='Campo 4')] are in the [index]"

## Operaciones básicas de dataframes

También es posible añadir nuevas columnas a un dataframe utilizando columnas que ya existen.

In [50]:
estudiantes["Nombre completo"] = estudiantes["Nombre"] + " " + estudiantes["Apellido"]
estudiantes

           Nombre Apellido Matrícula  Edad Nombre completo
Registro 1   Hugo    López    123455  20.0      Hugo López
Registro 2   Paco    Silva    736923  35.0      Paco Silva
Registro 3   Luis      Oca    971298   NaN        Luis Oca
Registro 4  Pedro  Ramírez    123098   NaN   Pedro Ramírez

In [52]:
# Eliminado de columnas
# del estudiantes["Nombre completo"]

# descartar
#axis=0 con las filas y axis = 1 son columnas.
#estudiantes.drop([2,3],axis = 0)
# con inplace = True los descartes son permanentes y actuara como un del
estudiantes.drop("Nombre completo",axis = 1,inplace = True)
estudiantes

KeyError: "['Nombre completo'] not found in axis"

In [53]:
# Indexar numéricamente los registros
estudiantes.reset_index(inplace = True)
estudiantes

        index Nombre Apellido Matrícula  Edad
0  Registro 1   Hugo    López    123455  20.0
1  Registro 2   Paco    Silva    736923  35.0
2  Registro 3   Luis      Oca    971298   NaN
3  Registro 4  Pedro  Ramírez    123098   NaN

In [54]:
# Acceso a ciertas columnas y ciertas filas.
estudiantes.loc[[0,3],["Matrícula","Edad"]]

  Matrícula  Edad
0    123455  20.0
3    123098   NaN

In [56]:
# Incluso podemos hacer seleción por filtrado
estudiantes[estudiantes["Edad"] > 20][["index","Edad","Matrícula"]]

        index  Edad Matrícula
1  Registro 2  35.0    736923

In [57]:
# Cambiando los nombres de las columnas
estudiantes.columns = ["Campo 1","Campo 2","Campo 3","Campo 4","Campo 5"]
estudiantes

      Campo 1 Campo 2  Campo 3 Campo 4  Campo 5
0  Registro 1    Hugo    López  123455     20.0
1  Registro 2    Paco    Silva  736923     35.0
2  Registro 3    Luis      Oca  971298      NaN
3  Registro 4   Pedro  Ramírez  123098      NaN

In [58]:
# Cambiando los nombres de las filas
estudiantes.index = estudiantes["Campo 4"]
estudiantes

            Campo 1 Campo 2  Campo 3 Campo 4  Campo 5
Campo 4
123455   Registro 1    Hugo    López  123455     20.0
736923   Registro 2    Paco    Silva  736923     35.0
971298   Registro 3    Luis      Oca  971298      NaN
123098   Registro 4   Pedro  Ramírez  123098      NaN

In [59]:
# Agregado de una fila
nuevo_elemento = "Registro 5, Helena, González, 888888, 29"
nuevo_elemento.split(",")

estudiantes.loc[888888] = nuevo_elemento.split(",")
estudiantes

            Campo 1  Campo 2    Campo 3  Campo 4 Campo 5
Campo 4
123455   Registro 1     Hugo      López   123455    20.0
736923   Registro 2     Paco      Silva   736923    35.0
971298   Registro 3     Luis        Oca   971298     NaN
123098   Registro 4    Pedro    Ramírez   123098     NaN
888888   Registro 5   Helena   González   888888      29

In [61]:
estudiantes.iloc[-1]

Campo 1    Registro 5
Campo 2        Helena
Campo 3      González
Campo 4        888888
Campo 5            29
Name: 888888, dtype: object

In [62]:
#Agregar nueva columna
estudiantes['nueva'] = 5
estudiantes

            Campo 1  Campo 2    Campo 3  Campo 4 Campo 5  nueva
Campo 4
123455   Registro 1     Hugo      López   123455    20.0      5
736923   Registro 2     Paco      Silva   736923    35.0      5
971298   Registro 3     Luis        Oca   971298     NaN      5
123098   Registro 4    Pedro    Ramírez   123098     NaN      5
888888   Registro 5   Helena   González   888888      29      5

In [66]:
# Visualizar encabezado y cola
estudiantes.head(3)

            Campo 1 Campo 2 Campo 3 Campo 4 Campo 5  nueva
Campo 4
123455   Registro 1    Hugo   López  123455    20.0      5
736923   Registro 2    Paco   Silva  736923    35.0      5
971298   Registro 3    Luis     Oca  971298     NaN      5

In [67]:
estudiantes.tail(1)

            Campo 1  Campo 2    Campo 3  Campo 4 Campo 5  nueva
Campo 4
888888   Registro 5   Helena   González   888888      29      5

In [68]:
estudiantes["Campo 5"] = pd.to_numeric(estudiantes["Campo 5"], downcast = "float")
estudiantes

            Campo 1  Campo 2    Campo 3  Campo 4  Campo 5  nueva
Campo 4
123455   Registro 1     Hugo      López   123455     20.0      5
736923   Registro 2     Paco      Silva   736923     35.0      5
971298   Registro 3     Luis        Oca   971298      NaN      5
123098   Registro 4    Pedro    Ramírez   123098      NaN      5
888888   Registro 5   Helena   González   888888     29.0      5

In [69]:
estudiantes["Campo 5"].sum()

84.0

In [70]:
estudiantes["Campo 5"].value_counts()

Campo 5
20.0    1
35.0    1
29.0    1
Name: count, dtype: int64

In [72]:
estudiantes.loc[777222] = ["Registro 6","José","López","777222",30,6]
estudiantes

            Campo 1  Campo 2    Campo 3  Campo 4  Campo 5  nueva
Campo 4
123455   Registro 1     Hugo      López   123455     20.0      5
736923   Registro 2     Paco      Silva   736923     35.0      5
971298   Registro 3     Luis        Oca   971298      NaN      5
123098   Registro 4    Pedro    Ramírez   123098      NaN      5
888888   Registro 5   Helena   González   888888     29.0      5
777222   Registro 6     José      López   777222     30.0      6

In [73]:
estudiantes["Campo 3"].value_counts()

Campo 3
López        2
Silva        1
Oca          1
Ramírez      1
 González    1
Name: count, dtype: int64

In [74]:
estudiantes.sort_values(by = "Campo 5",inplace = True, ascending=False)
estudiantes

            Campo 1  Campo 2    Campo 3  Campo 4  Campo 5  nueva
Campo 4
736923   Registro 2     Paco      Silva   736923     35.0      5
777222   Registro 6     José      López   777222     30.0      6
888888   Registro 5   Helena   González   888888     29.0      5
123455   Registro 1     Hugo      López   123455     20.0      5
971298   Registro 3     Luis        Oca   971298      NaN      5
123098   Registro 4    Pedro    Ramírez   123098      NaN      5

In [75]:
edad_media = estudiantes["Campo 5"].mean()
int(edad_media)

28

In [76]:
estudiantes["Campo 5"].fillna(int(edad_media),inplace = True)
estudiantes

            Campo 1  Campo 2    Campo 3  Campo 4  Campo 5  nueva
Campo 4
736923   Registro 2     Paco      Silva   736923     35.0      5
777222   Registro 6     José      López   777222     30.0      6
888888   Registro 5   Helena   González   888888     29.0      5
123455   Registro 1     Hugo      López   123455     20.0      5
971298   Registro 3     Luis        Oca   971298     28.0      5
123098   Registro 4    Pedro    Ramírez   123098     28.0      5

In [77]:
estudiantes.sort_index(ascending = True,inplace = True)
estudiantes

TypeError: '<' not supported between instances of 'int' and 'str'

In [78]:
estudiantes.sort_values(by = ["Campo 3","Campo 5"],ascending = [True,False],inplace = True)
estudiantes

            Campo 1  Campo 2    Campo 3  Campo 4  Campo 5  nueva
Campo 4
888888   Registro 5   Helena   González   888888     29.0      5
777222   Registro 6     José      López   777222     30.0      6
123455   Registro 1     Hugo      López   123455     20.0      5
971298   Registro 3     Luis        Oca   971298     28.0      5
123098   Registro 4    Pedro    Ramírez   123098     28.0      5
736923   Registro 2     Paco      Silva   736923     35.0      5

In [79]:
estudiantes[estudiantes["Campo 3"] == "López"]

            Campo 1 Campo 2 Campo 3 Campo 4  Campo 5  nueva
Campo 4
777222   Registro 6    José   López  777222     30.0      6
123455   Registro 1    Hugo   López  123455     20.0      5

In [80]:
estudiantes["Campo 2"] = estudiantes["Campo 2"].str.upper()
estudiantes

            Campo 1  Campo 2    Campo 3  Campo 4  Campo 5  nueva
Campo 4
888888   Registro 5   HELENA   González   888888     29.0      5
777222   Registro 6     JOSÉ      López   777222     30.0      6
123455   Registro 1     HUGO      López   123455     20.0      5
971298   Registro 3     LUIS        Oca   971298     28.0      5
123098   Registro 4    PEDRO    Ramírez   123098     28.0      5
736923   Registro 2     PACO      Silva   736923     35.0      5

In [81]:
estudiantes["Campo 4"].str.len()

Campo 4
888888    7
777222    6
123455    6
971298    6
123098    6
736923    6
Name: Campo 4, dtype: int64

In [83]:
estudiantes.loc["536271"] = ["Registro 7","Luisa","González","536271","23","1"]
estudiantes["Estado"] = ["Activo","Baja","Baja","Graduado","Activo","Activo","Baja"]

estudiantes

            Campo 1  Campo 2    Campo 3  Campo 4 Campo 5 nueva    Estado
Campo 4
888888   Registro 5   HELENA   González   888888    29.0     5    Activo
777222   Registro 6     JOSÉ      López   777222    30.0     6      Baja
123455   Registro 1     HUGO      López   123455    20.0     5      Baja
971298   Registro 3     LUIS        Oca   971298    28.0     5  Graduado
123098   Registro 4    PEDRO    Ramírez   123098    28.0     5    Activo
736923   Registro 2     PACO      Silva   736923    35.0     5    Activo
536271   Registro 7    Luisa   González   536271      23     1      Baja

In [84]:
estudiantes

            Campo 1  Campo 2    Campo 3  Campo 4 Campo 5 nueva    Estado
Campo 4
888888   Registro 5   HELENA   González   888888    29.0     5    Activo
777222   Registro 6     JOSÉ      López   777222    30.0     6      Baja
123455   Registro 1     HUGO      López   123455    20.0     5      Baja
971298   Registro 3     LUIS        Oca   971298    28.0     5  Graduado
123098   Registro 4    PEDRO    Ramírez   123098    28.0     5    Activo
736923   Registro 2     PACO      Silva   736923    35.0     5    Activo
536271   Registro 7    Luisa   González   536271      23     1      Baja

In [85]:
pd.get_dummies(estudiantes["Estado"])

         Activo   Baja  Graduado
Campo 4
888888     True  False     False
777222    False   True     False
123455    False   True     False
971298    False  False      True
123098     True  False     False
736923     True  False     False
536271    False   True     False

In [86]:
Frame = pd.concat([estudiantes,pd.get_dummies(estudiantes["Estado"])],axis = 1)
Frame

,Campo 1,Campo 2,Campo 3,Campo 4,Campo 5,nueva,Estado,Activo,Baja,Graduado
Campo 4,,,,,,,,,,
888888,Registro 5,HELENA,González,888888,29.0,5,Activo,True,False,False
777222,Registro 6,JOSÉ,López,777222,30.0,6,Baja,False,True,False
123455,Registro 1,HUGO,López,123455,20.0,5,Baja,False,True,False
971298,Registro 3,LUIS,Oca,971298,28.0,5,Graduado,False,False,True
123098,Registro 4,PEDRO,Ramírez,123098,28.0,5,Activo,True,False,False
736923,Registro 2,PACO,Silva,736923,35.0,5,Activo,True,False,False
536271,Registro 7,Luisa,González,536271,23,1,Baja,False,True,False

In [87]:
Frame["Fac"] = [4,3,1,4,5,1,8]
Frame["Sexo"] = ["0","1","1","1","1","1","0"]
Frame

,Campo 1,Campo 2,Campo 3,Campo 4,Campo 5,nueva,Estado,Activo,Baja,Graduado,Fac,Sexo
Campo 4,,,,,,,,,,,,
888888,Registro 5,HELENA,González,888888,29.0,5,Activo,True,False,False,4,0
777222,Registro 6,JOSÉ,López,777222,30.0,6,Baja,False,True,False,3,1
123455,Registro 1,HUGO,López,123455,20.0,5,Baja,False,True,False,1,1
971298,Registro 3,LUIS,Oca,971298,28.0,5,Graduado,False,False,True,4,1
123098,Registro 4,PEDRO,Ramírez,123098,28.0,5,Activo,True,False,False,5,1
736923,Registro 2,PACO,Silva,736923,35.0,5,Activo,True,False,False,1,1
536271,Registro 7,Luisa,González,536271,23,1,Baja,False,True,False,8,0

In [88]:
Frame.groupby('Estado')["Fac"].sum()

Estado
Activo      10
Baja        12
Graduado     4
Name: Fac, dtype: int64

In [89]:
Frame.groupby(['Estado',"Sexo"])["Fac"].sum()

Estado    Sexo
Activo    0       4
          1       6
Baja      0       8
          1       4
Graduado  1       4
Name: Fac, dtype: int64

In [90]:
Frame.groupby(['Estado',"Sexo"])["Fac"].sum()["Activo","0"]

4

In [91]:
Frame.describe()

            Fac
count  7.000000
mean   3.714286
std    2.429972
min    1.000000
25%    2.000000
50%    4.000000
75%    4.500000
max    8.000000

Crear un Dataframe de asignaturas con índices  (Sistemas inteligentes, Base datos, Algebra, Redes y IoT Industrial) y columnas propias (año, semestre, nombre profesor, apellido profesor, créditos)

In [5]:
ejer = pd.DataFrame(
[[2,1,"Profesor1","Apellido1",40],
 [4,2,"Profesor2","Apellido2",30],
 [3,2,"Profesor3","Apellido3",20],
 [3,2,"Profesor4","Apellido4",60]    
], index = ["Sistemas inteligentes","Base Datos","Redes","IoT Industrial"],
    columns = ["año","semestre","nombre profesor","apellido profesor","creditos"]
)

Recuperar la columna créditos

In [6]:
ejer.columns

Index(['año', 'semestre', 'nombre profesor', 'apellido profesor', 'creditos'], dtype='object')

Recuperar las asignaturas Redes e IoT Industrial

In [10]:
ejer.loc[["Redes","IoT Industrial"]]

                año  semestre nombre profesor apellido profesor  creditos
Redes             3         2       Profesor3         Apellido3        20
IoT Industrial    3         2       Profesor4         Apellido4        60

Recuperar la asignatura de base de datos con su “numero” de indice

In [13]:
ejer.iloc[1]

año                          4
semestre                     2
nombre profesor      Profesor2
apellido profesor    Apellido2
creditos                    30
Name: Base Datos, dtype: object

Añadir una nueva columna que sea la concatenación del nombre completo del profesor

In [14]:
ejer["Nombre Completo"]=ejer["nombre profesor"] + " " + ejer ["apellido profesor"]
ejer

,año,semestre,nombre profesor,apellido profesor,creditos,Nombre Completo
Sistemas inteligentes,2,1,Profesor1,Apellido1,40,Profesor1 Apellido1
Base Datos,4,2,Profesor2,Apellido2,30,Profesor2 Apellido2
Redes,3,2,Profesor3,Apellido3,20,Profesor3 Apellido3
IoT Industrial,3,2,Profesor4,Apellido4,60,Profesor4 Apellido4

Recuperar las asignaturas con + de 40 créditos

In [16]:
ejer[ejer["creditos"] > 40]

,año,semestre,nombre profesor,apellido profesor,creditos,Nombre Completo
IoT Industrial,3,2,Profesor4,Apellido4,60,Profesor4 Apellido4

Añadir nueva asignatura (Programación)

In [29]:
ejer.loc["Programacion"]=[4,1,"Profesor5","Apellido5",80,"tes"]

In [30]:
ejer

,año,semestre,nombre profesor,apellido profesor,creditos,Nombre Completo
Sistemas inteligentes,2,1,Profesor1,Apellido1,40,Profesor1 Apellido1
Base Datos,4,2,Profesor2,Apellido2,30,Profesor2 Apellido2
Redes,3,2,Profesor3,Apellido3,20,Profesor3 Apellido3
IoT Industrial,3,2,Profesor4,Apellido4,60,Profesor4 Apellido4
5,4,1,Profesor5,Apellido5,80,tes
6,4,1,Profesor5,Apellido5,80,tes
Programacion,4,1,Profesor5,Apellido5,80,tes

Ordenar por año y semestre

In [35]:
ejer.sort_values(by = ["año","semestre"],inplace = True, ascending=False)

In [36]:
ejer

,año,semestre,nombre profesor,apellido profesor,creditos,Nombre Completo
Base Datos,4,2,Profesor2,Apellido2,30,Profesor2 Apellido2
5,4,1,Profesor5,Apellido5,80,tes
6,4,1,Profesor5,Apellido5,80,tes
Programacion,4,1,Profesor5,Apellido5,80,tes
Redes,3,2,Profesor3,Apellido3,20,Profesor3 Apellido3
IoT Industrial,3,2,Profesor4,Apellido4,60,Profesor4 Apellido4
Sistemas inteligentes,2,1,Profesor1,Apellido1,40,Profesor1 Apellido1

Cual es la media de créditos por asignatura

In [38]:
ejer["creditos"].mean()

55.714285714285715